CREATE DATABASE fond;

DROP TABLE IF EXISTS subscribes;
CREATE TABLE IF NOT EXISTS subscribes (
  `id` smallint UNSIGNED NOT NULL AUTO_INCREMENT,
  `email` varchar(100) NOT NULL UNIQUE,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1000;

DROP TABLE IF EXISTS pubs;
CREATE TABLE IF NOT EXISTS pubs (
  `id` smallint UNSIGNED NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `link` varchar(250) NOT NULL,
  `pubdate` TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1000;

DROP TABLE IF EXISTS content_articles;
CREATE TABLE IF NOT EXISTS content_articles (
  `id` smallint UNSIGNED NOT NULL AUTO_INCREMENT,
  `active` tinyint NOT NULL DEFAULT 1,
  `category` tinyint NOT NULL DEFAULT 1,
  `url` varchar(100) NOT NULL,
  `hash_url_crc32` int UNSIGNED NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` varchar(100),
  `preview` TEXT NOT NULL,
  `content` TEXT NOT NULL,
  `opentext` varchar(150) NOT NULL DEFAULT 'Открыть',
  `pubdate` TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  `views` int UNSIGNED NOT NULL DEFAULT 1,
  `authorid` smallint UNSIGNED DEFAULT 0,
  PRIMARY KEY (`id`),
  KEY `hash_url` (`hash_url_crc32`, `active`),
  KEY `cat_active_hash_url` (`category`, `active`, `hash_url_crc32`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1000;

INSERT INTO `pubs` VALUES (1001,'Вступительная информация','http://vk.com/doc-97294749_406389105?dl=7260e25fc4142f5f4c','2015-07-10 05:28:44'),(1002,'О народных советах','http://fondoo-ru.livejournal.com/1000.html','2015-07-13 03:56:59');
INSERT INTO `content_articles` VALUES (1001,1,1,'about',3052675811,'О&nbsp;Проекте',NULL,'','<h2>Введение</h2><p>Прежде чем начать, давайте прогуляемся по&nbsp;центру вашего родного города и&nbsp;кое-что подсчитаем. Не&nbsp;считали&nbsp;ли вы, сколько лампочек горит в&nbsp;вашем городе? Много&nbsp;ли фонарей освещают излюбленные места? Чтобы в&nbsp;ночном городе можно было спокойно передвигаться пешком или на&nbsp;транспорте, каждые несколько метров утыканы осветительными приборами. Каждая лампочка это сколько-то&nbsp;киловатт*часов потребленной энергии. Какова цена потребленной электроэнергии для <em>общего</em> комфорта?</p><h3>Если не&nbsp;государство, то&nbsp;почему этот собственник не&nbsp;само общество?</h3><p>Не&nbsp;важно какова цена, важно <em>кто</em> получает прибыль от&nbsp;поставляемой электроэнергии. За&nbsp;каждым конкретным предприятием есть собственник, который получает \"чистую прибыль\", и&nbsp;далеко не&nbsp;всегда государство им&nbsp;является. Если не&nbsp;государство, то&nbsp;почему этот собственник не&nbsp;само общество?</p><p>Ответ на&nbsp;этот вызов и&nbsp;есть наш (наш&nbsp;&mdash; я, вы!)  общественный проект&nbsp;&mdash; <strong>Фонд Общего Обогащения</strong>.</p><p>Фонд Общего Обогащения&nbsp;&mdash; организация, участником (учредителем, акционером)  и&nbsp;выгодополучателем которой будет народ (только физические лица).</p><p><img src=\"/images/general.png\" class="img-responsive" alt="Упрощенная схема обращения денег" /></p><h3>Возвращение богатств народу?</h3><p>Используя законные методы и&nbsp;правила капитализма, с&nbsp;помощью которых с&nbsp;распадом СССР ограбили народ, проект должен будет возвращать или&nbsp;же создавать новые богатства, занимаясь исключительно полезной деятельностью для всего общества в&nbsp;целом (не&nbsp;только для участников Фонда). Можно мельком перечислить какие формы деятельности должны осуществляться:</p><ul><li>Производственная (создание, разработка, созидание)  деятельность</li><li>Приобретение долей в&nbsp;организациях обязательного народного хозяйства (участие в&nbsp;ключевых отраслей экономики страны) </li><li>Накопление интеллектуальной собственности</li><li>Инвестиционная деятельность</li></ul><h2>Управление Фондом участниками сообщества</h2><p>Проект <strong>fondoo.ru</strong> создается исключительно со&nbsp;светлыми намерениями, полностью открыт и&nbsp;любой желающий может принять участие в&nbsp;нем: в&nbsp;разработке, развитии и&nbsp;управлении. Эти светлые намерения, политика открытости, справедливости, честности, дружелюбия, стремление к&nbsp;светлыми идеалам, созиданию, развитию (и&nbsp;много чего другого)  должны быть отражены в&nbsp;манифесте сообщества, к&nbsp;разработке которого приглашается любой желающий.</p><p>Управление Фондом&nbsp;&mdash; еще один достойный внимания аспект проекта. Оно основывается на&nbsp;иерархической системе народных советов, которая по&nbsp;своей природе служит на&nbsp;пользу только всему сообществу, позволяет легко доносить до&nbsp;всех интересные идеи и&nbsp;полезные решения, и&nbsp;также легко отфильтровывать частные, неугодные большинству лобби. Более детально с&nbsp;этой системой принятия решений вы&nbsp;можете <a href=\"http://fondoo-ru.livejournal.com/1000.html\">здесь</a> и <a href=\"http://vk.com/doc-97294749_406389105?dl=7260e25fc4142f5f4c\">здесь</a>.</p><p>Система народных советов в&nbsp;настоящее время разрабатывается и&nbsp;это первоочередная задача, чтобы все остальные задачи сообщества решались с&nbsp;ее&nbsp;помощью.</p><p>К&nbsp;её <a href=\"https://github.com/fondoo\">разработке</a> приглашаются разработчики, программисты, дизайнеры, верстальщики, системные администраторы и&nbsp;другие специалисты информационных технологий.</p><h2>Идея еще не&nbsp;ясна?</h2><p>Суть: создать общественное объединение, учредителями которой является только общество, народ, обычные люди (физические лица)  и&nbsp;задача которой будет развивать и&nbsp;замыкать на&nbsp;себя экономические отношения с&nbsp;народом, чтобы потребительская способность общества конвертировалась в&nbsp;доход для самого общества.</p><p>Формально, это будет Открытое (
Публичное)  Акционерное Общество (или Закрытое?), с&nbsp;выпуском акций номинальной стоимостью по&nbsp;10000 рублей каждая. Набрав достаточное (от&nbsp;100 тыс.)  количество равноправных участников, сообщество превратится в&nbsp;крупного игрока и&nbsp;начнет путь достижения своих целей, которое оно само себе поставит. Содержание устава, свойства акций, правила &nbsp;&mdash; сообщество будет разрабатывать общими усилиями, примкнуть к&nbsp;которым может любой уже сейчас.</p><p>Целое больше, чем просто сумма его частей. Все в&nbsp;наших руках.</p><p><em>Обязательно вступайте в&nbsp;группу вконтакте, подписывайтесь на&nbsp;почтовую рассылку (гугл-группа)  &nbsp;&mdash; участвуйте в&nbsp;обсуждениях и&nbsp;разработке проекта!</em></p><p> </p>','Открыть','2015-07-11 09:03:25',1,0);
